CREATE TABLE VegetablesAndFruits (
	id SERIAL PRIMARY KEY,
	name VARCHAR(100) NOT NULL,
	type VARCHAR(10) NOT NULL,
	color VARCHAR(50),
	calories FLOAT,
	description TEXT
);

INSERT INTO VegetablesAndFruits (name, type, color, calories, description) VALUES
('Авокадо', 'фрукт', 'зелений', 160.0, 'Авокадо - це фрукт з маслястою текстурою, який містить багато здорових жирів та використовується для приготування гуакамоле та інших страв.'),
('Ананас', 'фрукт', 'жовтий', 50.0, 'Ананас - це солодкий і ароматний фрукт з колючою шкіркою, який часто вживається у свіжому вигляді або у вигляді соку.'),
('Черешня', 'фрукт', 'червоний', 50.0, 'Черешня - це маленький соковитий фрукт з солодким смаком, який часто вживається у свіжому вигляді або для виготовлення варення.'),
('Брокколі', 'овоч', 'зелений', 34.0, 'Брокколі - це овоч зеленого кольору, який багатий на вітаміни та мінерали і часто вживається як приголомшлива частина страви.'),
('Капуста', 'овоч', 'зелений', 25.0, 'Капуста - це овоч з сірими листками, який містить багато вітамінів та фітонутрієнтів і часто вживається як приголомшлива частина страви.'),
('Лимон', 'фрукт', 'жовтий', 29.0, 'Лимон - це кислий цитрусовий фрукт з жовтою шкіркою, який використовується як приправа в стравах або для приготування лимонаду.'),
('Кукурудза', 'овоч', 'жовтий', 86.0, 'Кукурудза - це овоч з жовтими крупками, який містить багато вуглеводів та використовується як прикраса для багатьох страв.'),
('Огірок', 'овоч', 'зелений', 15.0, 'Огірок - це овоч зеленого кольору, який містить багато води та використовується як основний інгредієнт для салатів.'),
('Помідор', 'овоч', 'червоний', 18.0, 'Помідор - це овоч з червоними шкірками, який містить багато вітамінів та антиоксидантів і часто вживається як основний інгредієнт для соусів та салатів.'),
('Банан', 'фрукт', 'жовтий', 89.0, 'Банани - дуже популярний фрукт, який містить багато калію і використовується як перекус або інгредієнт для приготування десертів.'),
('Морква', 'овоч', 'оранжевий', 41.0, 'Морква - це овоч з оранжевою шкіркою, який містить багато бета-каротину та інших корисних речовин і часто вживається у свіжому вигляді або у приготуванні страв.'),
('Яблуко', 'фрукт', 'червоний', 52.0, 'Яблука - це солодкий і соковитий фрукт, який часто вживається в свіжому вигляді або в приготуванні страв і напоїв.'),
('Цукіні', 'овоч', 'зелений', 17.0, 'Цукіні - це овоч зеленого кольору, який містить багато води та використовується для приготування різноманітних страв.');






















